#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.buckets.aws_s3_bucket_policy.S3: Refreshing state... [id=kpinetwork-frontend]
module.buckets.aws_s3_bucket.kpinetwork_frontend_project: Refreshing state... [id=kpinetwork-frontend]
module.cdn.aws_cloudfront_distribution.prod_distribution: Refreshing state... [id=E36EZH0Q33R0DK]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket.kpinetwork_frontend will be created
  + resource "aws_s3_bucket" "kpinetwork_frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "kpinetwork-frontend"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
              + "POST",
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
          + max_age_seconds = 3000
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.buckets.aws_s3_bucket.kpinetwork_frontend_project will be destroyed
  - resource "aws_s3_bucket" "kpinetwork_frontend_project" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::kpinetwork-frontend" -> null
      - bucket                      = "kpinetwork-frontend" -> null
      - bucket_domain_name          = "kpinetwork-frontend.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "kpinetwork-frontend.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "kpinetwork-frontend" -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "PUT",
              - "POST",
              - "GET",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.buckets.aws_s3_bucket_policy.S3 will be destroyed
  - resource "aws_s3_bucket_policy" "S3" {
      - bucket = "kpinetwork-frontend" -> null
      - id     = "kpinetwork-frontend" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::kpinetwork-frontend/*"
                      - Sid       = "PublicReadForGetBucketObjects"
                    },
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::435552912911:user/terraform-provider-frontend"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::kpinetwork-frontend",
                          - "arn:aws:s3:::kpinetwork-frontend/*",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # module.cdn.aws_cloudfront_distribution.prod_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "prod_distribution" {
        id                             = "E36EZH0Q33R0DK"
        tags                           = {}
        # (19 unchanged attributes hidden)



      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "kpinetwork-frontend.s3.us-west-2.amazonaws.com" -> null
          - origin_id           = "S3-kpinetwork-frontend" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "S3-kpinetwork-frontend"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }


        # (4 unchanged blocks hidden)
    }

  # module.policy.aws_s3_bucket_policy.S3 will be created
  + resource "aws_s3_bucket_policy" "S3" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::kpinetwork-frontend/*"
                      + Sid       = "PublicReadForGetBucketObjects"
                    },
                  + {
                      + Action    = "s3:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::435552912911:user/terraform-provider-frontend"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::kpinetwork-frontend",
                          + "arn:aws:s3:::kpinetwork-frontend/*",
                        ]
                      + Sid       = ""
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ridouku, Action: `pull_request`*